{
  "add_cross_attention": false,
  "architectures": [
    "CamembertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "politics",
    "1": "human_rights",
    "2": "quality_of_life",
    "3": "international",
    "4": "social",
    "5": "environment",
    "6": "economics",
    "7": "culture",
    "8": "labor",
    "9": "national_security",
    "10": "ict",
    "11": "education"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "culture": 7,
    "economics": 6,
    "education": 11,
    "environment": 5,
    "human_rights": 1,
    "ict": 10,
    "international": 3,
    "labor": 8,
    "national_security": 9,
    "politics": 0,
    "quality_of_life": 2,
    "social": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "camembert",
  "num_attention_head": 12,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "problem_type": "multi_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.5.4",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 25005
}
